public class எழுத்துவகை {
    final static int வல்லினஎண்மாறிலி = 128;
    final static int மெல்லினஎண்மாறிலி = 256;
    final static int உயிர்எண்மாறிலி = 512;
    final static int ஒற்றுஎண்மாறிலி = 1024;
    final static int ஆயுதஎண்மாறிலி =  2048;

    final static int நெடிலெண்மாறிலி = 8;
    final static int இடையினஎண்மாறிலி = வல்லினஎண்மாறிலி | மெல்லினஎண்மாறிலி;
    private static final String உயிர்வகைகுறில்மாறிலி = "குறில்";
    private static final String உயிர்வகைநெடில்மாறிலி = "நெடில்";
    final String ஒருங்குறி;
    final int தமிழ்தனிகுறியீடு;
    final String யாபியலெழுத்துவகை;
    final static String மெல்லினமாறிலி ="மெல்லினம்";
    final static String வல்லினமாறிலி ="வல்லினம்";
    final static String இடையினமாறிலி ="இடையினம்";

    எழுத்துவகை(String ஒருங்குறி, int தமிழ்தனிகுறியீடு) {
        this.ஒருங்குறி = ஒருங்குறி;
        this.தமிழ்தனிகுறியீடு = தமிழ்தனிகுறியீடு;
        this.யாபியலெழுத்துவகை = யாபியலெழுத்துவகையைபெறு();
    }

    private String யாபியலெழுத்துவகையைபெறு() {
        String யாபியலெழுத்துவகைய = "";
        if ( (this.தமிழ்தனிகுறியீடு &  ஒற்றுஎண்மாறிலி)  == ஒற்றுஎண்மாறிலி) {
            யாபியலெழுத்துவகைய = "ஓற்று";
        }
        if ( (this.தமிழ்தனிகுறியீடு &  உயிர்எண்மாறிலி)  == உயிர்எண்மாறிலி) {
            யாபியலெழுத்துவகைய = உயிர்வகையைபெறு();
        }
        return யாபியலெழுத்துவகைய;
    }
/*
    public void ஒருங்குறியைபெறுத்து(String ஒருங்குறி) {
        this.ஒருங்குறி = ஒருங்குறி;
    }

 */

    //mei	uyir	mel2	mel2	kuri/nedil	s	s	s
    //128	64	    32	    16	    8	        4	2	1
    //                          8    7    6    5    4    3            2   1   0
    //ayutham  mei      uyir     mel2 mel1 m3   m2   m1   kuril/nedil  s3  s2  s1
    //2048     1024     512      256  128  64   32   16   8            4   2   1

    public String உயிர்வகையைபெறு() {
        String உயிர்வகை ="";
        if ((this.தமிழ்தனிகுறியீடு & உயிர்எண்மாறிலி) == உயிர்எண்மாறிலி) {
            if ((this.தமிழ்தனிகுறியீடு & நெடிலெண்மாறிலி) == நெடிலெண்மாறிலி) {
                உயிர்வகை = உயிர்வகைநெடில்மாறிலி;
            }  else {
                உயிர்வகை = உயிர்வகைகுறில்மாறிலி;
            }

        }
        return உயிர்வகை;
    }

    public String மெய்வகையைபெறு() {
        if ((this.தமிழ்தனிகுறியீடு & இடையினஎண்மாறிலி) == இடையினஎண்மாறிலி) {
            return  இடையினமாறிலி;
        }

         if ((this.தமிழ்தனிகுறியீடு & வல்லினஎண்மாறிலி) == வல்லினஎண்மாறிலி) {
             return வல்லினமாறிலி;
         }
         if  ((this.தமிழ்தனிகுறியீடு & மெல்லினஎண்மாறிலி) == மெல்லினஎண்மாறிலி) {
            return மெல்லினமாறிலி;
         }
        return "";

    }



    public String ஒருங்குறியைபெறு() {
        return ஒருங்குறி;
    }

    private String unicode() {
        StringBuffer sb = new StringBuffer();
       for(int i=0; i < ஒருங்குறி.length(); i++) {
            char uniChar= ஒருங்குறி.charAt(i);
           sb.append(String.format("\\u%04x", (int) uniChar));
       }
      return sb.toString();
    }


    @Override
    public String toString() {
        return "\n" + ஒருங்குறி +  "=" +  unicode() +"|தமிழ்தனிகுறியீடு="  + String.format("%d", தமிழ்தனிகுறியீடு) +  "|படி16எண்=" + String.format("%04x", தமிழ்தனிகுறியீடு) +  "|படி2எண்=" + Binary.print(தமிழ்தனிகுறியீடு) + "|மெய்வகை=" + மெய்வகையைபெறு() + "|உயிர்வகை=" + உயிர்வகையைபெறு() + "|யாபியலெழுத்துவகை="+  யாபியலெழுத்துவகையைபெறு();
    }
}
